src/cf/Catalogs/вз_НастройкиПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>вз_НастройкиПодключения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вз_ВидыПодключенияКБазамДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/вз_ВидыПодключенияКБазамДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>вз_ВидыПодключенияКБазамДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнешнийЗапрос</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/вз_НастройкиПодключения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область Команды

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Если Модифицированность 
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка)
		Тогда
		ПоказатьПредупреждение(, "Требуется записать настройки", , "Внимание!");
		Возврат;
	КонецЕсли;
	
	Результат = ПроверитьПодключениеНаСервере();
	
	ПоказатьПредупреждение(, Результат, 10, "Проверка подключения");
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПодключениеНаСервере()
	
	ПараметрыПодключения = вз_ВнешниеЗапросыИсходящие.ПолучитьПараметрыПодключения(Объект.Идентификатор);
	Результат = вз_ВнешниеЗапросыИсходящие.ПроверкаПодключения(ПараметрыПодключения);	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Служебные

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Если Объект.ВидПодключения = 
		ПредопределенноеЗначение("Перечисление.вз_ВидыПодключенияКБазамДанных.ВнешнийЗапрос") 
		Тогда
		Элементы.СтрокаПодключения.Подсказка = 
			"Адрес публикации http-сервиса, в формате ""http://server-name/base-name/hs""";
	Иначе
		Элементы.СтрокаПодключения.Подсказка = "Строка подключения";
	КонецЕсли;
	
	Элементы.ВерсияПротокола.Видимость = 
		Объект.ВидПодключения = ПредопределенноеЗначение("Перечисление.вз_ВидыПодключенияКБазамДанных.ВнешнийЗапрос");
	Элементы.ВерсияПротокола.СписокВыбора.ЗагрузитьЗначения(ПоддерживаемыеВерсииПротокола());
	
КонецПроцедуры

&НаСервере
Функция ПоддерживаемыеВерсииПротокола()
	
	Если Объект.ВидПодключения = 
		ПредопределенноеЗначение("Перечисление.вз_ВидыПодключенияКБазамДанных.ВнешнийЗапрос") 
		Тогда
		Результат = вз_ВнешниеЗапросы.ПоддерживаемыеВерсииПротокола();	
	Иначе
		Результат = Новый Массив;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ЭтоНовый() Тогда
		СсылкаНаОбъект = Справочники.вз_НастройкиПодключения.ПолучитьСсылку(Новый УникальныйИдентификатор());
		ТекущийОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);		
	Иначе
		СсылкаНаОбъект = ТекущийОбъект.Ссылка;
	КонецЕсли;
	
	вз_ВнешниеЗапросыСлужебный.СохранитьПароль(СсылкаНаОбъект, Пароль);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПодключенияПриИзменении(Элемент)
	
	Объект.ВерсияПротокола = "";
	
	УправлениеЭлементамиФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти
